[
    {
        "id": 4,
        "title": "IA Aprentissage par renforcement; GeometrieDash",
        "image": "GeometrieDash.png",
        "description": "Developpement du jeu géométrie dash en C#, puis création d'une IA pour le jeu par renforcement",
        "longDescription": "Developpement du jeu géométrie dash en C#, puis création d'une IA pour le jeu par renforcement",
        "languages": [
            "C#",
            "BDD"
        ],
        "linkGit": "https://github.com/QuentinDoniczka/IA_GeometryDash",
        "linkProject": "",
        "linkVideo":""

    },
    {
        "id": 3,
        "title": "React heroku react-bootstrap",
        "image": "portfolio.png",
        "description": "Portfolio de présentation.",
        "longDescription": "Ce portfolio a été réalisé en React.js avec le framework react-bootstrap. Il est hébergé sur Heroku. React.js est utilisé pour sa flexibilité et sa performance dans la création d'applications Web à page unique (SPA). React-router-dom est intégré pour gérer la navigation entre les pages sans recharger la page entière, permettant ainsi une expérience utilisateur fluide. Bootstrap et react-bootstrap sont utilisés pour le design et la mise en page, ce qui permet d'avoir un site responsive et attrayant sans effort supplémentaire. Enfin, Heroku est utilisé pour héberger et déployer facilement l'application, offrant une solution cloud pratique pour un déploiement rapide.",
        "languages": [
            "JavaScript",
            "React",
            "Bootstrap",
            "React-bootstrap"
        ],
        "linkGit": "https://github.com/QuentinDoniczka/portfolioReact",
        "linkProject": "https://doniczka-quentin.herokuapp.com/",
        "linkVideo":""
    },    
    {
        "id": 2,
        "title": "javacript vanilla PHP",
        "image": "siteRecette.png",
        "description": "Creation et gestion de recette",
        "longDescription": "Ce projet a été réalisé en JavaScript vanilla et PHP, sans utiliser de bibliothèques ou de frameworks supplémentaires. L'objectif était d'apprendre et de comprendre les bases de ces deux langages de programmation pour améliorer la maîtrise des concepts fondamentaux. Le site permet la création, la suppression et l'affichage des recettes, ainsi que la gestion des droits de suppression. Il met en œuvre des interactions avec une base de données pour stocker et gérer les recettes. Ce projet est hébergé sur OVH, un fournisseur de services d'hébergement Web fiable et performant.",
        "languages": [
            "JavaScript",
            "PHP"
        ],
        "linkGit": "https://github.com/QuentinDoniczka/recette",
        "linkProject": "https://doniczkaquentin.ovh/signin/",
        "linkVideo":""
    },
    {
        "id": 1,
        "title": "React nodejs heroku",
        "image": "sqliteNode.png",
        "description": "Interation BDD front/back",
        "longDescription": "Ce projet est un exemple de site web qui permet de filtrer une liste de produits. Il a été développé en utilisant la bibliothèque React pour créer des composants interactifs tels que des formulaires et des tables de produits. Pour stocker les données des produits, le projet utilise une base de données SQLite et une API backend développée en utilisant Node.js. Cette API backend permet au site web de récupérer les données de produits et de les afficher en fonction des critères de filtrage spécifiés par l'utilisateur. Le site web utilise également des méthodes pour gérer les interactions de l'utilisateur et mettre à jour les informations affichées en temps réel. En somme, ce projet démontre l'utilisation de technologies modernes telles que React, Node.js, et SQLite pour créer des sites web interactifs et dynamiques.",
        "languages": [
            "JavaScript",
            "React",
            "Node.js"
        ],
        "linkGit": "https://github.com/QuentinDoniczka/React_Client_Server",
        "linkProject": "https://intense-lake-63928.herokuapp.com/",
        "linkVideo":""
    }
]